app/controllers/balances_controller.rb

	def index
		balance = Balance.first
---
SELECT  "balances".* FROM "balances"  ORDER BY "balances"."id" ASC LIMIT 1