app/controllers/categories_controller.rb

	def create
		category = Category.create name: params[:category][:name], balance_id: 1
		if category.errors.empty?
---
INSERT INTO "categories" ("name", "balance_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "new"], ["balance_id", 1], ["created_at", "2015-10-09 12:00:53.055176"], ["updated_at", "2015-10-09 12:00:53.055176"]]
SELECT "categories".* FROM "categories"