app/controllers/transactions_controller.rb

SELECT "transactions".* FROM "transactions"  ORDER BY "transactions"."created_at" DESC
---
  def index
  	transactions = Transaction.all.order(created_at: :desc)

INSERT INTO "transactions" ("summ", "comment", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["summ", 34.0], ["comment", "comment"], ["category_id", 3], ["created_at", "2015-10-09 15:09:57.172444"], ["updated_at", "2015-10-09 15:09:57.172444"]]
SELECT  "balances".* FROM "balances" WHERE "balances"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "balances" SET "value" = $1, "updated_at" = $2 WHERE "balances"."id" = $3  [["value", 1123.0], ["updated_at", "2015-10-09 15:12:49.742416"], ["id", 1]]
---
  def create
  	transaction = Transaction.create 	summ: params[:transaction][:summ],
  																	 	comment: params[:transaction][:comment],
  																	 	category_id: params[:transaction][:category_id]

  	balance = Balance.find 1
  	balance.value = balance.value + transaction.summ
    balance.save